[
  {
    "id": 1,
    "model": "Grok",
    "topic": "Soft Hurdle and Catch-Up Provision",
    "stem": "A private equity fund has a 'soft' hurdle rate of 8% and a 20% performance fee with a full catch-up provision. The fund invests $100 million and exits after one year with proceeds of $115 million. Assuming no management fees, the distribution to the General Partner (GP) is closest to:",
    "options": {
      "A": "$1.4 million",
      "B": "$3.0 million",
      "C": "$1.2 million"
    },
    "correct_answer": "B",
    "explanation": "<h3>First Principles Thinking: Soft Hurdle & Catch-Up Mechanics</h3><p><strong>B is correct.</strong> Start with the definition of a soft hurdle: once the return exceeds the threshold (8%), the performance fee applies to the <em>entire</em> profit, not just the excess. The 'catch-up' is the mechanism to achieve this. <br>1. Calculate Total Profit: $115m - $100m = $15m. <br>2. Calculate Hurdle Amount: $100m \\times 8\\% = $8m. <br>3. Check Condition: Since $15m > $8m, the soft hurdle is met. <br>4. Apply Catch-Up: The GP is entitled to 20% of the <em>total</em> profit. $15m \\times 20\\% = $3.0m. <br>Structure of payment: LP gets $8m first. GP then catches up on the profit until they hold 20% of the total distributed profit. Eventually, the split stabilizes at 80/20. Here, simply taking 20% of total profit suffices because the profit ($15m) is sufficiently higher than the hurdle ($8m) to allow the full catch-up.</p><p>A is incorrect: This calculates the fee as if it were a <em>hard</em> hurdle ($15m - $8m = $7m excess; $7m \\times 20\\% = $1.4m). Hard hurdles only pay on the surplus.</p><p>C is incorrect: This represents 8% of the profit ($1.2m), confusing the hurdle rate percentage with the fee base.</p>"
  },
  {
    "id": 2,
    "model": "Grok",
    "topic": "Hedge Fund High-Water Mark",
    "stem": "A hedge fund with a 20% incentive fee and a high-water mark (HWM) of $150 million has a current NAV of $140 million. The fund earns a 10% return in the current year. The incentive fee charged is closest to:",
    "options": {
      "A": "$2.8 million",
      "B": "$0.8 million",
      "C": "$0.0 million"
    },
    "correct_answer": "B",
    "explanation": "<h3>First Principles Thinking: High-Water Mark Integrity</h3><p><strong>B is correct.</strong> The high-water mark (HWM) represents the highest historical NAV per share (net of fees) that the fund has reached. Incentive fees are only paid on <em>new</em> value creation for investors. <br>1. Calculate Pre-Fee NAV: $140m \\times 1.10 = $154m. <br>2. Compare to HWM: $154m > $150m. The fund has exceeded the HWM. <br>3. Calculate Feeable Gain: $154m - $150m = $4m. <br>4. Apply Fee: $4m \\times 20\\% = $0.8m. <br>The fee is charged only on the $4m excess, not the total $14m gain, because the first $10m of the gain merely recouped past losses (getting from $140m back to $150m).</p><p>A is incorrect: This applies the 20% fee to the entire year's gain ($14m \\times 20\\% = $2.8m), ignoring the HWM protection that requires recouping losses first.</p><p>C is incorrect: This assumes no fee is paid because the <em>starting</em> NAV ($140m) was below the HWM, neglecting that the <em>ending</em> NAV exceeded it.</p>"
  },
  {
    "id": 3,
    "model": "Grok",
    "topic": "Leveraged Return Calculations",
    "stem": "An alternative investment strategy uses leverage of 1.5 (Total Assets / Equity). The underlying assets return 8%, and the cost of borrowing is 4%. If the asset return drops to 2%, the leveraged return will be:",
    "options": {
      "A": "-1.0%",
      "B": "1.0%",
      "C": "3.0%"
    },
    "correct_answer": "B",
    "explanation": "<h3>First Principles Thinking: Mechanics of Leverage</h3><p><strong>B is correct.</strong> Leverage magnifies the spread between the asset return and the borrowing cost. Derive from the balance sheet equation: Assets ($A$) = Equity ($E$) + Debt ($D$). <br>Leverage Ratio ($L$) = $A/E = 1.5$. This implies for every $1 of Equity, there is $0.5 of Debt (since $A=E+D$). <br>Formula: $R_E = R_A + \\frac{D}{E}(R_A - R_D)$. <br>Substitute values: $R_E = 2\\% + 0.5(2\\% - 4\\%)$. <br>Calculation: $R_E = 2\\% + 0.5(-2\\%) = 2\\% - 1\\% = 1\\%$. <br>Alternatively, use weighted average: Total Return ($1.5 \\times 2\\%$) - Interest Expense ($0.5 \\times 4\\%$) = Net Return to Equity ($1$). $3\\% - 2\\% = 1\\%$.</p><p>A is incorrect: This result often comes from misapplying the leverage ratio as the multiplier for the loss without adjusting for the base return (e.g., $2\\% - (1.5 \\times 2\\%)$).</p><p>C is incorrect: This incorrectly assumes the leverage multiplier applies directly to the asset return ($1.5 \\times 2\\% = 3\\%$) without subtracting the interest expense.</p>"
  },
  {
    "id": 4,
    "model": "Grok",
    "topic": "J-Curve and Management Fees",
    "stem": "A private equity fund has committed capital of $200 million and charges a 2% management fee on committed capital. In Year 1, 30% of capital is called and invested. The investments earn a gross return of 15% on invested capital. The net return to investors (as a percentage of invested capital) is closest to:",
    "options": {
      "A": "8.3%",
      "B": "13.0%",
      "C": "15.0%"
    },
    "correct_answer": "A",
    "explanation": "<h3>First Principles Thinking: The J-Curve Effect</h3><p><strong>A is correct.</strong> The 'J-Curve' phenomenon arises because fees are often charged on the full <em>committed</em> capital while returns are generated only on the <em>invested</em> portion early in the fund's life. <br>1. Calculate Invested Capital: $200m \\times 30\\% = $60m. <br>2. Calculate Gross Investment Profit: $60m \\times 15\\% = $9m. <br>3. Calculate Management Fee: $200m \\times 2\\% = $4m (Fee is on <em>committed</em>, not invested). <br>4. Calculate Net Profit: $9m (Gross) - $4m (Fee) = $5m. <br>5. Calculate Net Return on Invested: $5m / $60m = 8.33\\%. <br>The heavy drag of fees on uninvested capital significantly depresses early returns.</p><p>B is incorrect: This assumes the 2% fee is charged only on the invested capital ($15\\% - 2\\% = 13\\%), ignoring the standard PE structure of fees on committed capital.</p><p>C is incorrect: This is the gross return, ignoring management fees entirely.</p>"
  },
  {
    "id": 5,
    "model": "Grok",
    "topic": "Valuation Smoothing (Conceptual)",
    "stem": "When alternative assets are valued using 'mark-to-model' rather than market prices, the estimated Sharpe ratio is most likely to be:",
    "options": {
      "A": "Biased upward due to understated volatility.",
      "B": "Biased downward due to understated returns.",
      "C": "Unbiased if the model inputs are Level 3 compliant."
    },
    "correct_answer": "A",
    "explanation": "<h3>First Principles Thinking: Volatility Dampening</h3><p><strong>A is correct.</strong> Mark-to-model valuation (Level 3) relies on periodic appraisals or theoretical inputs rather than continuous market auction prices. This process inherently smooths data. <br>Mechanism: True market prices jump instantly to reflect news. Models often anchor to past values or adjust slowly (autocorrelation). <br>Result: This smoothing reduces the standard deviation (denominator of Sharpe) without necessarily reducing the mean return (numerator). <br>Conclusion: A smaller denominator artificially inflates the Sharpe ratio. This is a key risk in analyzing reported alternative investment metrics.</p><p>B is incorrect: While fees might lower returns, the valuation method itself tends to smooth the path of returns rather than systematically lowering the aggregate mean return.</p><p>C is incorrect: Level 3 compliance is an accounting standard for <em>disclosure</em>, not a guarantee of statistical equivalence to market pricing. The smoothing bias persists regardless of compliance.</p>"
  },
  {
    "id": 6,
    "model": "Grok",
    "topic": "American vs. European Waterfalls",
    "stem": "In a 'Deal-by-Deal' (American) waterfall with a clawback provision, the General Partner (GP) receives carried interest:",
    "options": {
      "A": "Only after the investors have received their initial capital and preferred return on the entire fund portfolio.",
      "B": "On each profitable investment individually, but may be required to return fees if subsequent losses occur.",
      "C": "On each profitable investment individually, with no obligation to return fees regardless of future performance."
    },
    "correct_answer": "B",
    "explanation": "<h3>First Principles Thinking: Incentive Timing vs. Alignment</h3><p><strong>B is correct.</strong> Waterfall structures dictate the <em>timing</em> of payouts. <br>1. Deal-by-Deal (American): The GP gets paid as soon as a specific <em>deal</em> is profitable. This benefits the GP via the time value of money. <br>2. Risk: The fund could lose money on later deals, meaning the GP was 'overpaid' based on the <em>aggregate</em> fund performance. <br>3. Correction Mechanism: The 'Clawback' provision forces the GP to return earlier distributions to align the final payout with the aggregate fund return (as if it were a Whole-of-Fund structure).</p><p>A is incorrect: This describes a Whole-of-Fund (European) waterfall, where early profits pay down the cost basis of the <em>entire</em> fund before the GP sees a dime.</p><p>C is incorrect: This describes a Deal-by-Deal waterfall <em>without</em> a clawback, which is rare and highly unfavorable to LPs as it allows the GP to profit even if the overall fund loses money.</p>"
  },
  {
    "id": 7,
    "model": "Grok",
    "topic": "IRR vs. MOIC Limitations",
    "stem": "A private equity fund reports a high Internal Rate of Return (IRR) but a low Multiple of Invested Capital (MOIC). This return profile most likely indicates:",
    "options": {
      "A": "The fund held investments for a long duration, allowing compounding to multiply capital.",
      "B": "The fund exited investments quickly, generating a high annualized rate on a small absolute gain.",
      "C": "The fund failed to beat its hurdle rate and paid no carried interest."
    },
    "correct_answer": "B",
    "explanation": "<h3>First Principles Thinking: Time Sensitivity of Metrics</h3><p><strong>B is correct.</strong> Analyze the math of the metrics. <br>IRR solves for the discount rate: $0 = -I + \\frac{C}{(1+r)^t}$. It is highly sensitive to time ($t$). A quick profit (small $t$) requires a massive $r$ to balance the equation. <br>MOIC is simply $\\frac{\\text{Total Cash Out}}{\\text{Total Cash In}}$. It ignores time. <br>Scenario: If you invest $100 and get $120 back in 1 month, MOIC is a modest 1.2x. However, the IRR is astronomical (annualizing that 20% gain 12 times). Thus, High IRR + Low MOIC = Short hold period / Quick flip.</p><p>A is incorrect: Long duration allows compounding to grow the numerator of MOIC. A long hold with a high IRR would mathematically necessitate a massive MOIC (e.g., 20% IRR over 10 years $\\approx$ 6x MOIC).</p><p>C is incorrect: The relationship between IRR and MOIC is independent of the hurdle rate; it is purely a function of cash flow timing and magnitude.</p>"
  }
]

