[
  {
    "id": 1,
    "format": "Which statements are correct",
    "stem": "A bond’s yield-based convexity is best interpreted as:",
    "statements": {
      "1": "A measure of how duration changes as yield changes.",
      "2": "Always negative for plain-vanilla, option-free bonds.",
      "3": "A curvature measure of the price–yield relationship (second-order effect).",
      "4": "A reason the duration-only price estimate has symmetric errors for yield rises and falls."
    },
    "options": {
      "a": "1, 2 and 3 only",
      "b": "1 and 4 only",
      "c": "2, 3 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "correct_answer": "b",
    "explanation": "Start from first principles: price is PV of cash flows discounted by yield; the first derivative gives duration (slope), the second derivative gives convexity (curvature). (1) is true because convexity captures how the slope (duration) itself changes with yield; (4) is true because convexity creates an asymmetric (curved) price response, making duration-only errors differ for up vs. down moves. (2) is false for option-free bonds (typically positive convexity), and (3) is true but option (4) grouping makes only (b) correct."
  },
  {
    "id": 2,
    "format": "Which statements are correct",
    "stem": "For two option-free bonds with the same yield and maturity, the bond with higher convexity will:",
    "statements": {
      "1": "Gain more in price when yields fall by a given amount.",
      "2": "Lose less in price when yields rise by a given amount.",
      "3": "Always have a higher coupon rate.",
      "4": "Have a more curved (less linear) price–yield relationship."
    },
    "options": {
      "a": "1, 2 and 3 only",
      "b": "1 and 4 only",
      "c": "2, 3 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "correct_answer": "b",
    "explanation": "First principle: convexity is curvature; higher curvature means price bends upward more for yield declines and bends downward less for yield increases, relative to a straight-line (duration) approximation. That makes (1) true and (4) true. (3) is not a rule: convexity depends on cash-flow timing/distribution, not “always higher coupon,” so the only listed combination that avoids (3) is (b)."
  },
  {
    "id": 3,
    "format": "Which statements are correct",
    "stem": "Yield-based convexity is most directly useful when you want to:",
    "statements": {
      "1": "Improve a duration-only estimate of price change for moderate yield moves.",
      "2": "Compare interest-rate sensitivity across bonds quoted by yield to maturity.",
      "3": "Accurately price bonds under a non-parallel yield-curve twist without any additional inputs.",
      "4": "Understand why option-free bond prices tend to fall less for rate rises than they rise for rate falls (same size move)."
    },
    "options": {
      "a": "1, 2 and 3 only",
      "b": "1 and 4 only",
      "c": "2, 3 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "correct_answer": "b",
    "explanation": "Building blocks: duration is first-order (linear) sensitivity to yield; convexity is second-order (curvature) that corrects the linear approximation. So (1) is true and (4) is true because curvature creates asymmetry between up/down moves. (3) is false: non-parallel curve shifts require key-rate/curve-based measures, not a single yield-based convexity number."
  },
  {
    "id": 4,
    "format": "Which statements are correct",
    "stem": "Regarding callable bonds and yield-based convexity:",
    "statements": {
      "1": "Callable bonds can exhibit negative convexity over some yield ranges.",
      "2": "Negative convexity arises because price appreciation is capped when yields fall.",
      "3": "Callable bonds must always have lower duration than comparable option-free bonds.",
      "4": "A duration-only estimate is generally more reliable for negatively convex instruments during yield declines."
    },
    "options": {
      "a": "1, 2 and 3 only",
      "b": "1 and 4 only",
      "c": "2, 3 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "correct_answer": "a",
    "explanation": "First principles: the embedded call is an issuer option exercised when refinancing is attractive; that truncates upside price when yields fall, creating negative curvature (1,2 true). (3) is not “must”: relative duration depends on where you are vs. the call region. (4) is false: negative convexity makes duration-only worse in rallies because the price–yield curve bends the “wrong way.”"
  },
  {
    "id": 5,
    "format": "Which statements are correct",
    "stem": "For an option-free bond portfolio, yield-based duration and convexity behave as:",
    "statements": {
      "1": "Portfolio duration is approximately the market-value-weighted average of constituent durations.",
      "2": "Portfolio convexity is approximately the market-value-weighted average of constituent convexities (on a consistent basis).",
      "3": "You can average durations using face-value weights without changing the result.",
      "4": "If all constituents have positive convexity, the portfolio must have positive convexity."
    },
    "options": {
      "a": "1, 2 and 3 only",
      "b": "1 and 4 only",
      "c": "2, 3 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "correct_answer": "b",
    "explanation": "Core building block: portfolio price is the sum of bond prices; differentiating a sum gives the sum of derivatives, which implies market-value weighting for yield sensitivities. That supports (1) and, for sign, (4) since a weighted average of positive numbers stays positive. (3) is wrong because face value ignores price/market value; (2) can fail if you mix inconsistent convexity definitions/scales, so only (b) is safe."
  },
  {
    "id": 6,
    "format": "Which statements are correct",
    "stem": "Why does convexity matter more as yield changes get larger?",
    "statements": {
      "1": "Because convexity is a second-order term that grows with the square of the yield change.",
      "2": "Because convexity replaces the need to model duration.",
      "3": "Because duration alone assumes the price–yield curve is a straight line locally.",
      "4": "Because convexity is only relevant for bonds with embedded options."
    },
    "options": {
      "a": "1, 2 and 3 only",
      "b": "1 and 4 only",
      "c": "2, 3 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "correct_answer": "a",
    "explanation": "First principles: a Taylor expansion approximates price changes as linear (duration) plus curvature (convexity); the curvature contribution scales with the square of the yield move. That makes (1) and (3) true; (2) is false because convexity supplements rather than replaces duration. (4) is false: option-free bonds also have convexity (typically positive)."
  },
  {
    "id": 7,
    "format": "Which statements are correct",
    "stem": "Comparing two option-free bonds with identical duration today, higher convexity implies:",
    "statements": {
      "1": "Less model error if you use a duration-only approximation for a given yield shock.",
      "2": "Greater benefit from curvature (better protection) across both yield rises and falls.",
      "3": "A guarantee of higher expected return.",
      "4": "A higher sensitivity of duration to changes in yield (duration changes more as yields move)."
    },
    "options": {
      "a": "1, 2 and 3 only",
      "b": "1 and 4 only",
      "c": "2, 3 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "correct_answer": "b",
    "explanation": "Building blocks: convexity is literally “how the slope changes,” so (4) is the definition-level intuition; higher convexity means duration changes more with yield. (1) is true because adding curvature reduces linear-approximation error. (2) is overclaimed as stated (the benefit depends on sign and context), and (3) is false because convexity is an interest-rate risk shape property, not a return guarantee."
  },
  {
    "id": 8,
    "format": "Reason-Based (R explains A)",
    "assertion": "Assertion (A): For an option-free bond, the duration-only estimate tends to understate the price gain when yields fall.",
    "reason": "Reason (R): The bond’s price–yield relationship is convex, so curvature adds extra upside beyond the tangent-line estimate.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "a",
    "explanation": "First principles: duration is the slope of the price–yield curve at a point; using only slope assumes the curve is locally a straight line. For option-free bonds the curve is typically convex, so the true curve sits above the tangent line for yield declines—creating extra price gain. That’s exactly why A is true and R correctly explains it."
  },
  {
    "id": 9,
    "format": "Reason-Based (R explains A)",
    "assertion": "Assertion (A): A bond can have negative convexity over some yield ranges.",
    "reason": "Reason (R): Embedded call options can cap price appreciation when yields fall, bending the price–yield curve inward.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "a",
    "explanation": "Start with payoffs: a callable bond is a straight bond minus an issuer call option. When yields fall, the issuer is more likely to call, which truncates further upside in bond price—so the curve can bend the “wrong way,” i.e., negative convexity. Thus A is true and R is the causal mechanism."
  },
  {
    "id": 10,
    "format": "Reason-Based (R explains A)",
    "assertion": "Assertion (A): For small yield changes, duration explains most of the price change for a plain-vanilla bond.",
    "reason": "Reason (R): Over a very small neighborhood, a smooth curve is well-approximated by its tangent line.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "a",
    "explanation": "First principles: duration is the first derivative of price with respect to yield, i.e., the local slope. Any smooth function can be approximated locally by a line using its first derivative; curvature matters less as the step size shrinks. So A is true and R explains why the linear term dominates for small moves."
  },
  {
    "id": 11,
    "format": "Reason-Based (R explains A)",
    "assertion": "Assertion (A): Convexity is generally desirable in risk management, holding duration constant.",
    "reason": "Reason (R): Positive convexity means you lose less when yields rise and gain more when yields fall, compared to a linear (duration-only) exposure.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "a",
    "explanation": "Building blocks: duration fixes the first-order exposure (slope), convexity shapes the second-order exposure (curvature). With positive convexity, the price–yield curve bows outward so the downside for yield increases is softened while the upside for yield decreases is amplified relative to the tangent line. That asymmetry is precisely why convexity is valuable, making both A and R true with R explaining A."
  },
  {
    "id": 12,
    "format": "Reason-Based (R explains A)",
    "assertion": "Assertion (A): Yield-based convexity alone is insufficient to fully explain a bond’s price change under a yield-curve twist.",
    "reason": "Reason (R): A single YTM change compresses many spot rates into one number, but different cash flows are exposed to different points on the curve.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "a",
    "explanation": "First principle: bond price is the sum of PVs discounted at term-specific rates; different maturities are driven by different parts of the curve. YTM is a summary statistic that matches the bond’s price today but does not uniquely pin down how each cash flow should reprice under non-parallel shifts. Therefore A is true, and R is the key building-block explanation."
  },
  {
    "id": 13,
    "format": "Reason-Based (R explains A)",
    "assertion": "Assertion (A): A portfolio’s yield-based duration is approximately the market-value-weighted average of constituent durations.",
    "reason": "Reason (R): The portfolio price is the sum of bond prices, and differentiating a sum gives the sum of the derivatives.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "a",
    "explanation": "Start from identity: portfolio value equals Σ bond values. Duration is a scaled first derivative of value with respect to yield; linearity of differentiation means the portfolio’s first derivative is the sum of constituents’ first derivatives, which turns into market-value weights once you normalize by total value. Hence A is true and R is the foundational reason."
  },
  {
    "id": 14,
    "format": "Assertion-Reason (UPSC style)",
    "assertion": "Assertion (A): A negatively convex bond can become more interest-rate sensitive (higher effective duration) when yields fall.",
    "reason": "Reason (R): As yields fall, the embedded call option moves closer to being exercised, shortening expected cash-flow life and flattening price appreciation.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "d",
    "explanation": "First principles: for callable bonds, when yields fall and call likelihood rises, expected maturity shortens, which typically reduces duration (slope) rather than increases it. The reason statement correctly describes the mechanism (shortening and capped upside), but the assertion flips the direction of interest-rate sensitivity. So A is false, R is true."
  },
  {
    "id": 15,
    "format": "Assertion-Reason (UPSC style)",
    "assertion": "Assertion (A): If two option-free bonds have the same price and the same yield today, the one with more back-loaded cash flows will generally have higher convexity.",
    "reason": "Reason (R): Cash flows received further in the future are discounted more heavily and their PVs respond more nonlinearly to yield changes.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "a",
    "explanation": "Building blocks: yield sensitivity comes from discount factors; the further out the cash flow, the greater the curvature in its PV as yield changes because compounding/discounting acts repeatedly. A bond with more weight in later cash flows therefore exhibits stronger curvature (higher convexity), holding other conditions comparable. Hence A is true and R correctly explains it."
  },
  {
    "id": 16,
    "format": "Assertion-Reason (UPSC style)",
    "assertion": "Assertion (A): Positive convexity implies that for equal-sized yield moves up and down, the bond’s price increase from the yield decrease will exceed its price decrease from the yield increase.",
    "reason": "Reason (R): Positive convexity means the price–yield curve is bowed outward, so the curve lies above its tangent line for both directions, but more so on the rally side in percentage terms.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "a",
    "explanation": "First principles: convexity describes outward curvature of price vs. yield; curvature creates asymmetry relative to a linear slope-only estimate. With positive convexity, the gain from a yield drop exceeds the loss from an equal yield rise (same magnitude), because the curve bends in your favor. So A is true and R captures the curvature-based explanation."
  },
  {
    "id": 17,
    "format": "Assertion-Reason (UPSC style)",
    "assertion": "Assertion (A): A portfolio can have lower duration than each individual bond in the portfolio if you combine them properly.",
    "reason": "Reason (R): Duration is additive, so weighted averaging can produce a portfolio duration that lies between the minimum and maximum constituent durations.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "d",
    "explanation": "Building block: a market-value-weighted average cannot be below the minimum of the numbers being averaged (with nonnegative weights). So a long-only bond portfolio’s duration must lie between the shortest and longest constituent durations, not below all of them. A is false; R is true and is exactly the reason A is false."
  },
  {
    "id": 18,
    "format": "Assertion-Reason (UPSC style)",
    "assertion": "Assertion (A): Yield-based convexity is a purely mathematical concept and does not depend on the bond’s cash-flow structure.",
    "reason": "Reason (R): Convexity arises from compounding in discount factors applied to the timing and size of cash flows.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "d",
    "explanation": "First principles: convexity is computed mathematically, but its value is driven by cash-flow timing/weights because discount factors act on each cash flow at its time point. Change the structure (coupon level, amortization, embedded options) and you change the curvature. Therefore A is false, while R correctly states the foundational dependency."
  },
  {
    "id": 19,
    "format": "Assertion-Reason (UPSC style)",
    "assertion": "Assertion (A): For an option-free bond, yield-based convexity is typically positive because price is the sum of discounted cash flows.",
    "reason": "Reason (R): Each discounted cash flow is a convex function of yield, and sums of convex functions remain convex.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "a",
    "explanation": "Building blocks: PV of a fixed cash flow as a function of yield has curvature because discounting involves powers of (1+y); that creates convexity. Since bond price is the sum of those PVs, and convexity is preserved under addition, the aggregate is convex (positive convexity) for plain-vanilla bonds. Hence A is true and R provides the correct first-principles proof idea."
  },
  {
    "id": 20,
    "format": "Reason-Based (R explains A)",
    "assertion": "Assertion (A): If you match only duration between an asset and a liability, you can still be exposed to large yield shocks.",
    "reason": "Reason (R): Duration matching controls first-order sensitivity, but convexity differences drive second-order residual risk when yields move materially.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "a",
    "explanation": "First principles: immunization by duration is a local (linear) hedge—like matching slopes at a point. For bigger moves, curvature matters; if asset and liability convexities differ, their values diverge as the yield change grows. Therefore A is true, and R states the exact building-block reason."
  },
  {
    "id": 21,
    "format": "Reason-Based (R explains A)",
    "assertion": "Assertion (A): When a bond has negative convexity, using a standard duration+convexity (positive convexity) intuition can mislead you during rate declines.",
    "reason": "Reason (R): Negative convexity means the curvature term works against you; the price–yield curve flattens on rallies, so models assuming outward bowing overstate gains.",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not the correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "correct_answer": "a",
    "explanation": "Start from payoffs: with embedded issuer callability, the bond’s upside is truncated when yields fall, so curvature can turn negative. That flips the second-order effect: instead of adding upside relative to the linear estimate, curvature removes it, making “positive convexity” intuition wrong-way. Hence A is true and R is the causal mechanism."
  }
]
