[
	{
		"id": 7,
		"model": "Grok",
		"topic": "Pull-to-Par Effect",
		"stem": "Assuming a constant yield-to-maturity, as a non-callable, fixed-coupon bond approaches maturity, its price will:",
		"options": {
			"A": "Increase if trading at a premium due to amortization of the premium.",
			"B": "Decrease if trading at a discount due to amortization of the discount.",
			"C": "Increase if trading at a discount due to the pull-to-par effect."
		},
		"correct_answer": "C",
		"explanation": "C is correct. Discount bonds rise toward par as maturity nears, assuming constant YTM. A is incorrect; premium bonds decrease toward par. B is incorrect; discount bonds increase, not decrease."
	},
	{
		"id": 8,
		"model": "Grok",
		"topic": "Price Volatility and Duration",
		"stem": "For two bonds with the same maturity and yield, the one with higher price volatility most likely has:",
		"options": {
			"A": "A higher coupon rate.",
			"B": "A lower coupon rate.",
			"C": "The same coupon rate but traded at a premium."
		},
		"correct_answer": "B",
		"explanation": "B is correct. Lower-coupon bonds have higher duration and thus greater price volatility for yield changes. A is incorrect; higher coupons reduce duration. C is incorrect; premium pricing lowers effective duration compared to discount."
	},
	{
		"id": 9,
		"model": "Grok",
		"topic": "Yield Measures",
		"stem": "For a bond trading at a premium, the relationship among its coupon rate (CR), current yield (CY), and yield-to-maturity (YTM) is:",
		"options": {
			"A": "YTM > CY > CR.",
			"B": "CR > CY > YTM.",
			"C": "CY > CR > YTM."
		},
		"correct_answer": "B",
		"explanation": "B is correct. For premium bonds, CR > CY > YTM due to price above par and capital loss to maturity. A is incorrect; applies to discount bonds (YTM > CY > CR). C is incorrect; CY is between CR and YTM."
	},
	{
		"id": 10,
		"model": "Grok",
		"topic": "Price-Yield Relationship",
		"stem": "The price-yield curve for an option-free, fixed-coupon bond is:",
		"options": {
			"A": "Convex, with price increasing as yield increases.",
			"B": "Concave, with price decreasing as yield increases.",
			"C": "Convex, with price decreasing as yield increases."
		},
		"correct_answer": "C",
		"explanation": "C is correct. Inverse relationship (price down as yield up) with positive convexity (curve bows upward). A is incorrect; direction is inverse. B is incorrect; shape is convex, not concave."
	},
	{
		"id": 11,
		"model": "Grok",
		"topic": "Yield Equality Conditions",
		"stem": "A bond's current yield equals its yield-to-maturity only if:",
		"options": {
			"A": "The bond is a zero-coupon bond.",
			"B": "The bond trades at par value.",
			"C": "The bond has no reinvestment risk."
		},
		"correct_answer": "B",
		"explanation": "B is correct. At par, CY = CR = YTM. A is incorrect; zeros have CY = 0 < YTM. C is incorrect; reinvestment risk doesn't force equality."
	},
	{
		"id": 12,
		"model": "Grok",
		"topic": "Factors Affecting Volatility",
		"stem": "Holding other factors constant, the bond with the lowest interest rate risk is most likely a:",
		"options": {
			"A": "Long-term, low-coupon bond.",
			"B": "Short-term, high-coupon bond.",
			"C": "Long-term, high-coupon bond."
		},
		"correct_answer": "B",
		"explanation": "B is correct. Short maturity and high coupon minimize duration and thus interest rate risk. A is incorrect; maximizes duration. C is incorrect; long maturity increases duration despite high coupon."
	},
	{
		"id": 13,
		"model": "Grok",
		"topic": "Convexity and Maturity",
		"stem": "As a non-callable, fixed-coupon bond approaches maturity, its convexity:",
		"options": {
			"A": "Increases due to higher sensitivity to yield changes.",
			"B": "Remains constant if yield is unchanged.",
			"C": "Decreases as the bond behaves more like a short-term instrument."
		},
		"correct_answer": "C",
		"explanation": "C is correct. Convexity declines with shorter time to maturity. A is incorrect; sensitivity decreases. B is incorrect; convexity changes with time even at constant yield."
	},
	{
		"id": 14,
		"model": "Grok",
		"topic": "Macaulay Duration",
		"stem": "All else equal, a bond's Macaulay duration is highest when:",
		"options": {
			"A": "Coupon rate is high and maturity is short.",
			"B": "Coupon rate is low and maturity is long.",
			"C": "The bond is trading at a significant premium."
		},
		"correct_answer": "B",
		"explanation": "B is correct. Macaulay duration increases with longer maturity and lower coupon rate. A is incorrect; high coupon and short maturity minimize duration. C is incorrect; premium bonds have lower duration than discount bonds of same maturity and coupon."
	}
]
